package com.lpf.jd;

/**
 * 买卖股票最佳时机
 * <p>
 * <p>
 * 给定一个数组prices，它的第 i个元素 prices[i]表示一支给定股票第i天的价格。
 * 你只能选择某一天买入这只股票，并选择在未来的某一个不同的日子卖出该股票。设计一个算法来计算你所能获取的最大利润。
 * 返回你可以从这笔交易中获取的最大利润。如果你不能获取任何利润，返回0。
 * 示例 1：
 * 输入：[7,1,5,3,6,4]输出：5解释：在第 2 天（股票价格 = 1）的时候买入，在第 5 天（股票价格 = 6）的时候卖出，最大利润 = 6-1 = 5 。
 * 注意利润不能是 7-1 = 6, 因为卖出价格需要大于买入价格；同时，你不能在买入前卖出股票。
 * 示例 2：
 * 输入：prices = [7,6,4,3,1]输出：0解释：在这种情况下, 没有交易完成, 所以最大利润为 0。
 */
public class Demo {

    public static void main(String[] args) {
        int[] prices = {7, 1, 5, 3, 6, 4};

    }

    public int maxProfit() {

        return 0;
    }
}
